src_ext/InformationRegisters/УЗ_РеквизитыОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УЗ_РеквизитыОрганизаций</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИПБезЛицензии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерЛицензии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЛицензии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛицензиюВыдал</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолжностьПодписанта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОснованиеПолномочий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлатежныеРеквизиты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_РеквизитыОрганизаций/Ext/ManagerModule.bsl
//Реквизиты организации для справки об оплате обучения и договора (этап 2.1, В40).
//
//Организации хозяина заимствованы без реквизитов: ИНН, КПП и наименование читаются из его карточки
//(УЗ_Печать.СведенияОбОрганизации через УЗ_Среда), а то, чего в типовых нет или что лежит в разных местах, —
//здесь: лицензия на образовательную деятельность или признак «ИП ведёт образовательную деятельность лично»
//(ст. 219 НК РФ в редакции 389-ФЗ), ответственный за справки, подписант договоров, адрес, телефон, банк.

#Область ПрограммныйИнтерфейс

//Всё об организации для справки и договора — Структура:
//  поля УЗ_Печать.СведенияОбОрганизации (Наименование, НаименованиеПолное, ИНН, КПП, ЭтоИП, ФИОПредпринимателя…);
//  ресурсы регистра (ИПБезЛицензии, НомерЛицензии, ДатаЛицензии, ЛицензиюВыдал, Ответственный, Подписант,
//  ДолжностьПодписанта, ОснованиеПолномочий, Адрес, Телефон, ПлатежныеРеквизиты);
//  ЕстьЛицензия — номер и дата лицензии заполнены;
//  ВправеВыдаватьСправку — лицензия или ИП без лицензии, который действительно ИП;
//  ОснованиеДеятельности — «лицензии от 01.09.2025 № Л035-…, выданной …» / «сведений ЕГРИП…» / "" (для договора);
//  НаименованиеДляСправки — сокращённое наименование организации, у ИП — его фамилия, имя, отчество (п. 21).
Функция РеквизитыОрганизации(Организация) Экспорт

	Реквизиты = УЗ_Печать.СведенияОбОрганизации(Организация);
	Для Каждого Ресурс Из Метаданные.РегистрыСведений.УЗ_РеквизитыОрганизаций.Ресурсы Цикл
		Реквизиты.Вставить(Ресурс.Имя, Ресурс.Тип.ПривестиЗначение(Неопределено));
	КонецЦикла;
	Если ЗначениеЗаполнено(Организация) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РеквизитыОрганизаций.ИПБезЛицензии КАК ИПБезЛицензии,
		|	РеквизитыОрганизаций.НомерЛицензии КАК НомерЛицензии,
		|	РеквизитыОрганизаций.ДатаЛицензии КАК ДатаЛицензии,
		|	РеквизитыОрганизаций.ЛицензиюВыдал КАК ЛицензиюВыдал,
		|	РеквизитыОрганизаций.Ответственный КАК Ответственный,
		|	РеквизитыОрганизаций.Подписант КАК Подписант,
		|	РеквизитыОрганизаций.ДолжностьПодписанта КАК ДолжностьПодписанта,
		|	РеквизитыОрганизаций.ОснованиеПолномочий КАК ОснованиеПолномочий,
		|	РеквизитыОрганизаций.Адрес КАК Адрес,
		|	РеквизитыОрганизаций.Телефон КАК Телефон,
		|	РеквизитыОрганизаций.ПлатежныеРеквизиты КАК ПлатежныеРеквизиты
		|ИЗ
		|	РегистрСведений.УЗ_РеквизитыОрганизаций КАК РеквизитыОрганизаций
		|ГДЕ
		|	РеквизитыОрганизаций.Организация = &Организация";
		Запрос.УстановитьПараметр("Организация", Организация);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(Реквизиты, Выборка);
		КонецЕсли;
	КонецЕсли;

	Реквизиты.Вставить("ЕстьЛицензия",
		Не ПустаяСтрока(Реквизиты.НомерЛицензии) И ЗначениеЗаполнено(Реквизиты.ДатаЛицензии));
	Реквизиты.Вставить("ВправеВыдаватьСправку",
		Реквизиты.ЕстьЛицензия Или (Реквизиты.ИПБезЛицензии И Реквизиты.ЭтоИП));
	Если Реквизиты.ЕстьЛицензия Тогда
		Основание = СтрШаблон(НСтр("ru = 'лицензии на осуществление образовательной деятельности от %1 № %2'"),
			Формат(Реквизиты.ДатаЛицензии, "ДЛФ=D"), СокрЛП(Реквизиты.НомерЛицензии));
		Если Не ПустаяСтрока(Реквизиты.ЛицензиюВыдал) Тогда
			Основание = Основание + ", " + НСтр("ru = 'выданной'") + " " + СокрЛП(Реквизиты.ЛицензиюВыдал);
		КонецЕсли;
	ИначеЕсли Реквизиты.ИПБезЛицензии И Реквизиты.ЭтоИП Тогда
		Основание = НСтр("ru = 'сведений об осуществлении образовательной деятельности индивидуальным "
			+ "предпринимателем непосредственно, внесённых в ЕГРИП'");
	Иначе
		Основание = "";
	КонецЕсли;
	Реквизиты.Вставить("ОснованиеДеятельности", Основание);
	Реквизиты.Вставить("НаименованиеДляСправки",
		?(Реквизиты.ЭтоИП И Не ПустаяСтрока(Реквизиты.ФИОПредпринимателя), Реквизиты.ФИОПредпринимателя,
			Реквизиты.Наименование));
	Возврат Реквизиты;

КонецФункции

//Почему организация не может выдать справку об оплате обучения (массив строк; пусто — может).
//Отказы (порядок заполнения справки, п. 1; ст. 219 НК РФ): нет ИНН; ни лицензии, ни признака «ИП без лицензии»;
//признак «ИП без лицензии» у организации, которая не ИП.
Функция ПричиныОтказаВСправке(Реквизиты, Организация) Экспорт

	Причины = Новый Массив;
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Причины.Добавить(НСтр("ru = 'Укажите организацию.'"));
		Возврат Причины;
	КонецЕсли;
	Если ПустаяСтрока(Реквизиты.ИНН) Тогда
		Причины.Добавить(СтрШаблон(НСтр("ru = 'В карточке организации «%1» не заполнен ИНН — без него справку не "
			+ "выдать.'"),
			Организация));
	КонецЕсли;
	Если Реквизиты.ИПБезЛицензии И Не Реквизиты.ЭтоИП Тогда
		Причины.Добавить(СтрШаблон(НСтр("ru = 'Организация «%1» отмечена «ИП ведёт образовательную деятельность "
			+ "лично», но это не индивидуальный предприниматель (ИНН не из 12 цифр): без лицензии справку для "
				+ "вычета выдаёт только ИП, который учит сам.'"),
			Организация));
	ИначеЕсли Не Реквизиты.ВправеВыдаватьСправку Тогда
		Причины.Добавить(СтрШаблон(НСтр("ru = 'У организации «%1» не указана лицензия на образовательную "
			+ "деятельность (номер и дата — «Реквизиты организаций для справок и договоров»). Справку для "
				+ "налогового вычета выдают организации и ИП с лицензией и ИП, который учит сам (ст. 219 НК РФ).'"),
			Организация));
	КонецЕсли;
	Возврат Причины;

КонецФункции

#КонецОбласти
